<template>
  <div class="px-[50px] mb-[186px] pt-[50px] xl:pt-[138px]">
    <h4 class="app-text-h1 w-full mt-12 mb-[30px]" id="books">Книги</h4>
    <div class="">
      <BookItem v-for="(item, idx) in books" :key="idx" :item="item" />
    </div>
  </div>
</template>
<script setup>
const books = ref([
  {
    title: "про скепсис",
    description:
      "Книга «Скепсис» – фронтова повість, заснована на подіях 2014-2015 років. Я писав її, вражений дрімучою «совковістю», з котрою зіштовхнувся повз 12 років від звільнення з армії. Жодних реформ не було проведено, «барство» й самодурство, що квітнули в період моєї служби (1994-2002) нікуди не поділися. Я знову повернувся в ту ж саму структуру, навіть більш деградовану. Але що таке є «армія»? Це в першу чергу, відзеркалення суспільства. І під час бойових дій це все вилізло назовні – некомпетентність командирів, відсутність ефективного управління й т.п. Я навмисно не вказував назви населених пунктів, бо тоді ще не був певен, чи не є ця інформація секретною. Проте зараз уже можна повісти, що до першої ротації моя батарея виконувала завдання в районі м. Щастя, потім у районі Станиці Луганської. Всі імена, прізвища й позивні змінені. У книзі присутні жарти, з елементами чорного гумору – на фронті без того ніяк. Нецензурної лексики я уникав свідомо, бо їй не місце в літературі. Напевне.",
    image: "/images/book1.png",
  },
  {
    title: "про розірвані ґердани",
    description:
      "Книга «Скепсис» – фронтова повість, заснована на подіях 2014-2015 років. Я писав її, вражений дрімучою «совковістю», з котрою зіштовхнувся повз 12 років від звільнення з армії. Жодних реформ не було проведено, «барство» й самодурство, що квітнули в період моєї служби (1994-2002) нікуди не поділися. Я знову повернувся в ту ж саму структуру, навіть більш деградовану. Але що таке є «армія»? Це в першу чергу, відзеркалення суспільства. І під час бойових дій це все вилізло назовні – некомпетентність командирів, відсутність ефективного управління й т.п. Я навмисно не вказував назви населених пунктів, бо тоді ще не був певен, чи не є ця інформація секретною. Проте зараз уже можна повісти, що до першої ротації моя батарея виконувала завдання в районі м. Щастя, потім у районі Станиці Луганської. Всі імена, прізвища й позивні змінені. У книзі присутні жарти, з елементами чорного гумору – на фронті без того ніяк. Нецензурної лексики я уникав свідомо, бо їй не місце в літературі. Напевне.",
    image: "/images/book2.png",
  },
]);
</script>
