<template>
  <div class="px-4 sm:px-8 md:px-16 lg:px-42 mx-auto overflow-hidden">
    <div class="app-text-h1 pt-8 sm:pt-12 lg:pt-20">інтерв'ю</div>
    <article class="app-text-body py-8 sm:py-12 relative">
      <IconLightning1
        class="absolute right-[-90px] rotate-180 md:rotate-0 md:left-[-220px] top-[-50px] md:top-[-90px]"
      />
      Вітаю, любий читачу. Зазвичай ніхто не заглядає на подібні розділи на
      сайтах, проте ти це зробив, честь тобі й хвала! Тому намагатимусь
      розвеселити твоє серце й піднести настрій коротким описом свого буремного,
      проте не надто оригінального життєвого шляху.
      <br /><br />
      Явився я на світ Божий останнього місяця сімдесят шостого року двадцятого
      сторіччя – саме тоді, коли зародились перші бактерії з водоростями. Тоді
      бронтозаври чубились зі стегозаврами за володіння найвигіднішими
      галявинами, порослими древньою соковитою травичкою, а безсердні шаблезубі
      тигри тільки й дивились, як зʼїсти переможця тої борні – це я написав для
      прикладу, аби поколінню міленіалів було зрозуміліше. Для старшого сегменту
      й так ясно, що народився я в часи розквіту тричі клятого вошивого «совка»,
      най би його шляки трафили.
      <br /><br />
      Тато військовий, мама вчителька – класика жанру. Родом вони з Вінничини,
      але завдяки циганській професії батька, що зобумовлювала постійні переїзди
      країною, народився я в Криму, звідки моє мале репетуюче тільце на першому
      році життя транспортували до Запоріжжя. Там затримались трохи довше, але
      не надто. Відповідно, дитячий садочок «Свєтлячок» гостинно розчинив переді
      мною двері в місті Улан-Батор, що на монгольщині. До 1986 року я там
      милувався сухоребрими коровами, які харчувались на смітниках й
      результативно ловив головою снігові кульки з камінням усередині – їх щедро
      насипали нам малолітні нащадки ЧінгізХана, з первинною відвертістю
      показуючи своє ставлення до незваних гостей – на лобі й досі маю доказ у
      вигляді шраму від тих часів.
      <br /><br />
      Потім доля зробила фінт вухами й моє пухкеньке тільце опинилось у
      львівській області, де й спокійнісінько собі розвивалося, займаючись
      спортом й треньканням на гітарі. Аж у 17 років (а це буремні девʼяності,
      прошу зауважити), вирішив наслідувати прикрий досвід батька. Відповідно,
      поступив до Одеського Інституту Сухопутних Військ, на аеромобільний
      факультет.
      <br /><br />
      Настрибався з парашутом, трохи постріляв й через чотири роки втрапив до
      вимріяної 80-ї аеромобільної бригади, що тоді знаходилась у місті Хирів. І
      там я все зрозумів. В першу чергу те, що достойно пожити армія мені не
      дасть. А радше, взагалі нічого не дасть – лише забере. Нерви, молодість і
      перспективи…ну є в мене таке – не мовчу, коли принижують. І бʼю у
      відповідь, коли мене бʼють. Тож, не дослуживши рік до закінчення контракту
      я назбирав побільше слини за щоки й плюнув на військо, глибоко
      розчарований.
      <IconLightning2 class="absolute right-[-590px] bottom-[-80px]" />
      <br /><br />
      Наступні десять років працював тілоохоронцем, тобто бодіґардом. Теж не
      радісна робота, безперспективна. Та й гроші не як у Кевіна Костнера у
      славнозвісній стрічці. Вже не памʼятаю як до мого життя ввійшов фʼюзинг,
      але добре памʼятаю, як перехворівши на виразку кишків, пішов на війну
      влітку 2014-го року. Відвоював. Повернувся. Зажурився. Фʼюзинг мій не
      приніс нічого окрім загострення ПТСР.
      <br /><br />
      Поки здуру не придбав твір одного відомого журналіста про війноньку. Ніби
      «перша книга про війну й все таке бла-бла-бла». Не дочитав й до половини.
      Розізлився. Бо пан письменник анібіса не чохлив у військовій справі й
      взаємовідносинах у армії. До того ж самих лише консультантів він назбирав
      під двадцять штук. Я сів писати. І написав. Через півроку рукопис
      «Скепсис» був готовий. Намагався проштовхнути 2 його в якесь видавництво,
      натомість від мене відвертали пики. Тож почав видавати власним коштом.
      <br /><br />
      Невдовзі написав другу книгу, «Розірвані Ґердани». Але тут уже став
      хитріший, відкрив ФОП й почав друкуватись незалежно від будь-кого. Пізніше
      написав ще дві – «Провісники» та «Снище Маґури». Проте за певних обставин
      не встиг їх видати – почалася друга гаряча фаза війни. Що ж, вижив,
      повернувся. «Допилюю» дві крайні книги, працюю над наступною, «Парадокс
      мʼяса». Йде важко, «по живому». Але я не здаюся. Ніколи не здаюся. Й буду
      товкти цю стіну, допоки не пробʼю її. Або вона не розчавить мене.
      <IconLightning3 class="absolute left-[-480px] bottom-[-80px]" />
    </article>
  </div>
</template>

<script setup>
import IconLightning1 from "~/components/icons/IconLightning1.vue";
import IconLightning2 from "~/components/icons/IconLightning2.vue";
import IconLightning3 from "~/components/icons/IconLightning3.vue";
</script>
